src/EmailWS/branches/generatedSourcesBranch/src/test/resources/messages/min_sample_sendable.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ema="http://decidr.de/webservices/Email" xmlns:dec="http://decidr.de/schema/DecidrTypes" xmlns:dec1="http://decidr.de/schema/DecidrWSTypes">
   <soapenv:Header/>
   <soapenv:Body>
      <ema:sendEmail>
         <ema:to>
            <!--1 or more repetitions:-->
            <dec:emailUser>
               <dec:email>rumberrd@studi.informatik.uni-stuttgart.de</dec:email>
            </dec:emailUser>
         </ema:to>
         <ema:cc xsi:nil="true"/>
         <ema:bcc xsi:nil="true"/>
         <!--type: string-->
         <ema:fromName>gero et</ema:fromName>
         <!--type: string-->
         <ema:fromAddress>root@localhost</ema:fromAddress>
         <!--type: string-->
         <ema:subject>quae divum incedo</ema:subject>
         <ema:headers xsi:nil="true"/>
         <!--type: string-->
         <ema:bodyTXT>circum claustra</ema:bodyTXT>
         <!--type: string-->
         <ema:bodyHTML xsi:nil="true"/>
         <ema:attachments xsi:nil="true"/>
      </ema:sendEmail>
   </soapenv:Body>
</soapenv:Envelope>